{
  "how_to_use": [
    {
      "title": "Creating a Profile",
      "description": "Open the Profiles screen and tap 'Add'. Enter your name, age, gender, height, weight, and relation. BMI is calculated automatically."
    },
    {
      "title": "Adding Vitals",
      "description": "Go to the Vitals screen, select a profile, and enter Pulse, Blood Pressure, Temperature, and SpO₂. Values can be measured using devices like BP monitors and oximeters."
    },
    {
      "title": "Tracking Hydration",
      "description": "Use quick-add buttons (+100ml, +250ml, +500ml) to log water intake. The app will remind you to drink at optimal times."
    },
    {
      "title": "How to Measure Pulse",
      "description": "Place two fingers on the inside of the wrist to feel the pulse. Count beats for 60 seconds. If you have a smartwatch or fitness band, you can use it to measure continuously and more accurately."
    },
    {
      "title": "Using a Home Blood Pressure Monitor",
      "description": "Sit comfortably and rest for 5 minutes before measuring. Keep the cuff at heart level and follow the device instructions. Record at the same time each day to observe trends."
    },
    {
      "title": "Temperature Measurement and Fever Guide",
      "description": "Use a digital thermometer. Normal body temperature is 36.5–37.5 °C. If temperature is > 38.0 °C for adults, take rest and fluids — consult a healthcare provider if it persists or is very high."
    },
    {
      "title": "SpO₂ (Oxygen Saturation) Measurement",
      "description": "Use a pulse oximeter on the fingertip. Normal SpO₂ is ≥95%. Values < 90% are critical; seek urgent medical attention. Avoid nail polish and cold hands for accurate reading."
    },
    {
      "title": "Hydration Tips",
      "description": "Aim for 2000–3000 ml per day depending on activity. Use quick-add buttons in the Hydration screen. Avoid excessive intake (>4L/day) without medical advice. Drink small amounts regularly rather than large amounts rarely."
    },
    {
      "title": "Interpreting Your Charts",
      "description": "Line charts show trends over time: look for upward/downward trends (e.g., rising BP). Pie chart and family overview show the distribution of normal/warning/critical vitals. Tap a pie slice to view detailed issues and recommendations."
    }
  ],
  "diet_plans": [
    {
      "title": "Balanced Diet",
      "description": "Include a mix of proteins, carbohydrates, fats, vitamins, and minerals in your meals. Divide into 3 main meals and 2 snacks daily."
    },
    {
      "title": "Low-Salt Diet",
      "description": "For high BP, reduce salt intake. Replace packaged snacks with fruits, and season with herbs instead of salt."
    } , {
      "title": "Hydrate & Rest",
      "description": "Drink water, rest, and monitor temperature. Seek medical care if fever persists."
    }
  ],
  "workout_tips": [
    {
      "title": "Daily Walking",
      "description": "Aim for 30 minutes of brisk walking every day. Track your steps with a smartwatch or phone app."
    },
    {
      "title": "Strength Training",
      "description": "Do light strength training (push-ups, squats, resistance bands) 2–3 times per week for muscle and bone health."
    },
    {
      "title": "Rest & Breathing",
      "description": "Sit quietly and do slow deep breathing for 5-10 minutes. Repeat if heart rate remains high."
    },
    {
      "title": "Low-salt Diet & Walk",
      "description": "Reduce salt intake and take a brisk 20-30 minute walk daily."
    }, {
      "title": "Seek Medical Help",
      "description": "Low oxygen detected. Contact healthcare services or visit emergency care if breathing difficulty occurs."
    }
  ],
  "health_standards": [
    {
      "title": "Pulse (Heart Rate)",
      "description": "Normal 60–100 BPM"
    },
    {
      "title": "Blood Pressure",
      "description": "Normal ~100–129 systolic / 60–85 diastolic mmHg."
    },
    {
      "title": "Temperature",
      "description": "Normal 36.5–37.5 °C."
    },
    {
      "title": "SpO₂",
      "description": "Normal ≥95%."
    }, {
      "title": "Hydration",
      "description": "Daily goal: 2000–3000 ml."
    }, {
      "title": "BMI",
      "description": "Calculated using height & weight. Categories: underweight, normal, overweight, obese."
    }
  ]
}
